In [40]:
import numpy as np
import pandas as pd
import plotly.express as px
import plotly.graph_objects as go
import matplotlib.pyplot as plt
import seaborn as sns

# ML
from sklearn.model_selection import train_test_split
## Decision tree
from sklearn import tree
from sklearn import metrics
## Random forest
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score, confusion_matrix, classification_report
## kNN
from sklearn.neighbors import KNeighborsClassifier
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler
from sklearn.inspection import DecisionBoundaryDisplay
from sklearn.neighbors import NearestNeighbors

# Visualizing Decision Trees
from sklearn.tree import export_graphviz
from six import StringIO
from IPython.display import Image
import pydotplus

%matplotlib inline

# Logistic Regression
from sklearn.linear_model import LogisticRegression

# SVM
from sklearn import svm

In [ ]:
gender = pd.read_csv("../data/raw/titanic/gender_submission.csv")
gender.info()
gender.head()

In [2]:
train = pd.read_csv("../data/raw/titanic/train.csv")
train.info()
train.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
test = pd.read_csv("../data/raw/titanic/test.csv") # dataset used by Kaggle to evaluate our model performance egal to everyone
test.info()
test.head()

In [ ]:
train["Sex"].unique()

In [ ]:
train["Pclass"].unique()

In [ ]:
train["Embarked"].unique()

In [ ]:
fig = px.histogram(train, x = "Sex", color = "Survived", barmode = "group", title = "Proportions of men and women who survived and died")
fig.show()

In [ ]:
fig = px.histogram(train, x = "Sex", color = "Survived", barmode = "group", facet_col = "Pclass",
                  title = "Proportions of men and women who survived and died according to their social class")
fig.show()

In [ ]:
fig = px.histogram(train, x = "Embarked", color = "Survived", barmode = "group", facet_col = "Pclass",
                  title = "Proportions of people who survived and died according to the embarked place and their social class")
fig.show()

In [ ]:
fig = px.histogram(train, x = "Embarked", color = "Sex", barmode = "group", facet_col = "Pclass",
                  title="Repartition of men and women in different embarked places according to their social class")
fig.show()

In [3]:
# Separating the features and the target (Survived)
X = train.drop(columns = ["Survived"])
X.info()
X.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Pclass       891 non-null    int64
 2   Name         891 non-null    object
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
y = train["Survived"]
y.info()
y.head()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Survived
Non-Null Count  Dtype
--------------  -----
891 non-null    int64
dtypes: int64(1)
memory usage: 7.1 KB

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [5]:
# Splitting the train dataset, to evaluate my model's performance
# Good practice: splitting the earlier as possible, to avoid that data from dataset could be found in the test dataset
# ex: filling missing data with mean of all data of the whole "Age" column: calculate the mean in the train dataset and report in
# in the test one
# ex: Embarked: missing values at 0 => to verify the impact on the dataset
X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size = 0.33, random_state = 42
)

In [ ]:
X_train

In [ ]:
X_test

In [ ]:
y_train

In [ ]:
y_test

In [6]:
def apply_male_int(sex):
    if sex == "male":
        sex = 1
    else:
        sex = 0
    return sex

In [7]:
X_train["male"] = X_train["Sex"].apply(apply_male_int)
X_train.info()
X_train.head()

<class 'pandas.core.frame.DataFrame'>
Index: 596 entries, 6 to 102
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  596 non-null    int64
 1   Pclass       596 non-null    int64
 2   Name         596 non-null    object
 3   Sex          596 non-null    object
 4   Age          478 non-null    float64
 5   SibSp        596 non-null    int64
 6   Parch        596 non-null    int64
 7   Ticket       596 non-null    object
 8   Fare         596 non-null    float64
 9   Cabin        134 non-null    object
 10  Embarked     595 non-null    object
 11  male         596 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 60.5+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male
6,7,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,1
718,719,3,"McEvoy, Mr. Michael",male,NaN,0,0,36568,15.5000,NaN,Q,1
685,686,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.0,1,2,SC/Paris 2123,41.5792,NaN,C,1
73,74,3,"Chronopoulos, Mr. Apostolos",male,26.0,1,0,2680,14.4542,NaN,C,1
882,883,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,0

In [8]:
def apply_Pclass_int(Pclass):
    if Pclass != 1:
        Pclass = 0
    return Pclass

In [9]:
X_train["Pclass1"] = X_train["Pclass"].apply(apply_Pclass_int)
X_train.info()
X_train.head()

<class 'pandas.core.frame.DataFrame'>
Index: 596 entries, 6 to 102
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  596 non-null    int64
 1   Pclass       596 non-null    int64
 2   Name         596 non-null    object
 3   Sex          596 non-null    object
 4   Age          478 non-null    float64
 5   SibSp        596 non-null    int64
 6   Parch        596 non-null    int64
 7   Ticket       596 non-null    object
 8   Fare         596 non-null    float64
 9   Cabin        134 non-null    object
 10  Embarked     595 non-null    object
 11  male         596 non-null    int64
 12  Pclass1      596 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 65.2+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1
6,7,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,1,1
718,719,3,"McEvoy, Mr. Michael",male,NaN,0,0,36568,15.5000,NaN,Q,1,0
685,686,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.0,1,2,SC/Paris 2123,41.5792,NaN,C,1,0
73,74,3,"Chronopoulos, Mr. Apostolos",male,26.0,1,0,2680,14.4542,NaN,C,1,0
882,883,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,0,0

In [10]:
def apply_Pclass(Pclass):
    if Pclass != 2:
        Pclass = 0
    else:
        Pclass = 1
    return Pclass

In [11]:
X_train["Pclass2"] = X_train["Pclass"].apply(apply_Pclass)
X_train.info()
X_train.head()

<class 'pandas.core.frame.DataFrame'>
Index: 596 entries, 6 to 102
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  596 non-null    int64
 1   Pclass       596 non-null    int64
 2   Name         596 non-null    object
 3   Sex          596 non-null    object
 4   Age          478 non-null    float64
 5   SibSp        596 non-null    int64
 6   Parch        596 non-null    int64
 7   Ticket       596 non-null    object
 8   Fare         596 non-null    float64
 9   Cabin        134 non-null    object
 10  Embarked     595 non-null    object
 11  male         596 non-null    int64
 12  Pclass1      596 non-null    int64
 13  Pclass2      596 non-null    int64
dtypes: float64(2), int64(7), object(5)
memory usage: 69.8+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2
6,7,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,1,1,0
718,719,3,"McEvoy, Mr. Michael",male,NaN,0,0,36568,15.5000,NaN,Q,1,0,0
685,686,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.0,1,2,SC/Paris 2123,41.5792,NaN,C,1,0,1
73,74,3,"Chronopoulos, Mr. Apostolos",male,26.0,1,0,2680,14.4542,NaN,C,1,0,0
882,883,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,0,0,0

In [12]:
def apply_Pclass_last(Pclass):
    if Pclass != 3:
        Pclass = 0
    else:
        Pclass = 1
    return Pclass

In [13]:
X_train["Pclass3"] = X_train["Pclass"].apply(apply_Pclass_last)
X_train.info()
X_train.head()

<class 'pandas.core.frame.DataFrame'>
Index: 596 entries, 6 to 102
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  596 non-null    int64
 1   Pclass       596 non-null    int64
 2   Name         596 non-null    object
 3   Sex          596 non-null    object
 4   Age          478 non-null    float64
 5   SibSp        596 non-null    int64
 6   Parch        596 non-null    int64
 7   Ticket       596 non-null    object
 8   Fare         596 non-null    float64
 9   Cabin        134 non-null    object
 10  Embarked     595 non-null    object
 11  male         596 non-null    int64
 12  Pclass1      596 non-null    int64
 13  Pclass2      596 non-null    int64
 14  Pclass3      596 non-null    int64
dtypes: float64(2), int64(8), object(5)
memory usage: 74.5+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2,Pclass3
6,7,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,1,1,0,0
718,719,3,"McEvoy, Mr. Michael",male,NaN,0,0,36568,15.5000,NaN,Q,1,0,0,1
685,686,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.0,1,2,SC/Paris 2123,41.5792,NaN,C,1,0,1,0
73,74,3,"Chronopoulos, Mr. Apostolos",male,26.0,1,0,2680,14.4542,NaN,C,1,0,0,1
882,883,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,0,0,0,1

In [14]:
# replacing NaN values by the mean of the column in Age one
X_train["Age"].unique()

array([54.  ,   nan, 25.  , 26.  , 22.  , 31.  , 49.  , 19.  , 24.  ,
       16.  , 39.  , 47.  , 60.  , 27.  , 38.  , 44.  , 21.  , 45.  ,
        8.  , 32.  , 50.  , 23.  , 15.  , 28.  , 41.  , 33.  , 52.  ,
       20.  ,  9.  , 43.  , 17.  , 37.  , 62.  , 46.  , 29.  , 56.  ,
       59.  , 58.  ,  3.  , 30.  , 28.5 , 36.  ,  0.75, 35.  , 55.  ,
       51.  ,  2.  , 14.  , 45.5 ,  4.  , 40.5 , 40.  , 18.  , 12.  ,
       11.  ,  1.  ,  7.  , 70.5 , 34.  , 70.  , 42.  , 48.  , 80.  ,
       55.5 , 14.5 , 10.  , 53.  , 32.5 , 74.  , 64.  ,  6.  ,  5.  ,
       24.5 ,  0.42, 61.  ,  0.67, 13.  ,  0.83])

In [15]:
mean_age = X_train["Age"].mean()
mean_age

29.525983263598327

In [16]:
X_train["Age"].fillna(mean_age, inplace = True)
X_train.info()
X_train.head()

<class 'pandas.core.frame.DataFrame'>
Index: 596 entries, 6 to 102
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  596 non-null    int64
 1   Pclass       596 non-null    int64
 2   Name         596 non-null    object
 3   Sex          596 non-null    object
 4   Age          596 non-null    float64
 5   SibSp        596 non-null    int64
 6   Parch        596 non-null    int64
 7   Ticket       596 non-null    object
 8   Fare         596 non-null    float64
 9   Cabin        134 non-null    object
 10  Embarked     595 non-null    object
 11  male         596 non-null    int64
 12  Pclass1      596 non-null    int64
 13  Pclass2      596 non-null    int64
 14  Pclass3      596 non-null    int64
dtypes: float64(2), int64(8), object(5)
memory usage: 74.5+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2,Pclass3
6,7,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S,1,1,0,0
718,719,3,"McEvoy, Mr. Michael",male,29.525983,0,0,36568,15.5000,NaN,Q,1,0,0,1
685,686,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.000000,1,2,SC/Paris 2123,41.5792,NaN,C,1,0,1,0
73,74,3,"Chronopoulos, Mr. Apostolos",male,26.000000,1,0,2680,14.4542,NaN,C,1,0,0,1
882,883,3,"Dahlberg, Miss. Gerda Ulrika",female,22.000000,0,0,7552,10.5167,NaN,S,0,0,0,1

In [17]:
def apply_embarked_S(embarked):
    if embarked != "S":
        embarked = 0
    else:
        embarked = 1
    return embarked

In [18]:
X_train["Embarked_S"] = X_train["Embarked"].apply(apply_embarked_S)
X_train.info()
X_train.head()

<class 'pandas.core.frame.DataFrame'>
Index: 596 entries, 6 to 102
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  596 non-null    int64
 1   Pclass       596 non-null    int64
 2   Name         596 non-null    object
 3   Sex          596 non-null    object
 4   Age          596 non-null    float64
 5   SibSp        596 non-null    int64
 6   Parch        596 non-null    int64
 7   Ticket       596 non-null    object
 8   Fare         596 non-null    float64
 9   Cabin        134 non-null    object
 10  Embarked     595 non-null    object
 11  male         596 non-null    int64
 12  Pclass1      596 non-null    int64
 13  Pclass2      596 non-null    int64
 14  Pclass3      596 non-null    int64
 15  Embarked_S   596 non-null    int64
dtypes: float64(2), int64(9), object(5)
memory usage: 79.2+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2,Pclass3,Embarked_S
6,7,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S,1,1,0,0,1
718,719,3,"McEvoy, Mr. Michael",male,29.525983,0,0,36568,15.5000,NaN,Q,1,0,0,1,0
685,686,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.000000,1,2,SC/Paris 2123,41.5792,NaN,C,1,0,1,0,0
73,74,3,"Chronopoulos, Mr. Apostolos",male,26.000000,1,0,2680,14.4542,NaN,C,1,0,0,1,0
882,883,3,"Dahlberg, Miss. Gerda Ulrika",female,22.000000,0,0,7552,10.5167,NaN,S,0,0,0,1,1

In [19]:
def apply_embarked_Q(embarked):
    if embarked != "Q":
        embarked = 0
    else:
        embarked = 1
    return embarked

In [20]:
X_train["Embarked_Q"] = X_train["Embarked"].apply(apply_embarked_Q)
X_train.info()
X_train.head()

<class 'pandas.core.frame.DataFrame'>
Index: 596 entries, 6 to 102
Data columns (total 17 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  596 non-null    int64
 1   Pclass       596 non-null    int64
 2   Name         596 non-null    object
 3   Sex          596 non-null    object
 4   Age          596 non-null    float64
 5   SibSp        596 non-null    int64
 6   Parch        596 non-null    int64
 7   Ticket       596 non-null    object
 8   Fare         596 non-null    float64
 9   Cabin        134 non-null    object
 10  Embarked     595 non-null    object
 11  male         596 non-null    int64
 12  Pclass1      596 non-null    int64
 13  Pclass2      596 non-null    int64
 14  Pclass3      596 non-null    int64
 15  Embarked_S   596 non-null    int64
 16  Embarked_Q   596 non-null    int64
dtypes: float64(2), int64(10), object(5)
memory usage: 83.8+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2,Pclass3,Embarked_S,Embarked_Q
6,7,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S,1,1,0,0,1,0
718,719,3,"McEvoy, Mr. Michael",male,29.525983,0,0,36568,15.5000,NaN,Q,1,0,0,1,0,1
685,686,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.000000,1,2,SC/Paris 2123,41.5792,NaN,C,1,0,1,0,0,0
73,74,3,"Chronopoulos, Mr. Apostolos",male,26.000000,1,0,2680,14.4542,NaN,C,1,0,0,1,0,0
882,883,3,"Dahlberg, Miss. Gerda Ulrika",female,22.000000,0,0,7552,10.5167,NaN,S,0,0,0,1,1,0

In [21]:
def apply_embarked_C(embarked):
    if embarked != "C":
        embarked = 0
    else:
        embarked = 1
    return embarked

In [22]:
X_train["Embarked_C"] = X_train["Embarked"].apply(apply_embarked_C)
X_train.info()
X_train.head()

<class 'pandas.core.frame.DataFrame'>
Index: 596 entries, 6 to 102
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  596 non-null    int64
 1   Pclass       596 non-null    int64
 2   Name         596 non-null    object
 3   Sex          596 non-null    object
 4   Age          596 non-null    float64
 5   SibSp        596 non-null    int64
 6   Parch        596 non-null    int64
 7   Ticket       596 non-null    object
 8   Fare         596 non-null    float64
 9   Cabin        134 non-null    object
 10  Embarked     595 non-null    object
 11  male         596 non-null    int64
 12  Pclass1      596 non-null    int64
 13  Pclass2      596 non-null    int64
 14  Pclass3      596 non-null    int64
 15  Embarked_S   596 non-null    int64
 16  Embarked_Q   596 non-null    int64
 17  Embarked_C   596 non-null    int64
dtypes: float64(2), int64(11), object(5)
memory usage: 88.5+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2,Pclass3,Embarked_S,Embarked_Q,Embarked_C
6,7,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S,1,1,0,0,1,0,0
718,719,3,"McEvoy, Mr. Michael",male,29.525983,0,0,36568,15.5000,NaN,Q,1,0,0,1,0,1,0
685,686,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.000000,1,2,SC/Paris 2123,41.5792,NaN,C,1,0,1,0,0,0,1
73,74,3,"Chronopoulos, Mr. Apostolos",male,26.000000,1,0,2680,14.4542,NaN,C,1,0,0,1,0,0,1
882,883,3,"Dahlberg, Miss. Gerda Ulrika",female,22.000000,0,0,7552,10.5167,NaN,S,0,0,0,1,1,0,0

In [23]:
X_train = X_train.drop(columns = ["Name", "Sex", "Ticket", "Cabin", "Embarked"])
X_train.info()
X_train.head()

<class 'pandas.core.frame.DataFrame'>
Index: 596 entries, 6 to 102
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  596 non-null    int64
 1   Pclass       596 non-null    int64
 2   Age          596 non-null    float64
 3   SibSp        596 non-null    int64
 4   Parch        596 non-null    int64
 5   Fare         596 non-null    float64
 6   male         596 non-null    int64
 7   Pclass1      596 non-null    int64
 8   Pclass2      596 non-null    int64
 9   Pclass3      596 non-null    int64
 10  Embarked_S   596 non-null    int64
 11  Embarked_Q   596 non-null    int64
 12  Embarked_C   596 non-null    int64
dtypes: float64(2), int64(11)
memory usage: 65.2 KB

,PassengerId,Pclass,Age,SibSp,Parch,Fare,male,Pclass1,Pclass2,Pclass3,Embarked_S,Embarked_Q,Embarked_C
6,7,1,54.000000,0,0,51.8625,1,1,0,0,1,0,0
718,719,3,29.525983,0,0,15.5000,1,0,0,1,0,1,0
685,686,2,25.000000,1,2,41.5792,1,0,1,0,0,0,1
73,74,3,26.000000,1,0,14.4542,1,0,0,1,0,0,1
882,883,3,22.000000,0,0,10.5167,0,0,0,1,1,0,0

In [24]:
# same transformations on the X_test dataset
X_test["male"] = X_test["Sex"].apply(apply_male_int)
X_test.info()
X_test.head()

<class 'pandas.core.frame.DataFrame'>
Index: 295 entries, 709 to 173
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  295 non-null    int64
 1   Pclass       295 non-null    int64
 2   Name         295 non-null    object
 3   Sex          295 non-null    object
 4   Age          236 non-null    float64
 5   SibSp        295 non-null    int64
 6   Parch        295 non-null    int64
 7   Ticket       295 non-null    object
 8   Fare         295 non-null    float64
 9   Cabin        70 non-null     object
 10  Embarked     294 non-null    object
 11  male         295 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 30.0+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male
709,710,3,"Moubarek, Master. Halim Gonios (""William George"")",male,NaN,1,1,2661,15.2458,NaN,C,1
439,440,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.0,0,0,C.A. 18723,10.5000,NaN,S,1
840,841,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S,1
720,721,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.0,0,1,248727,33.0000,NaN,S,0
39,40,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C,0

In [25]:
X_test["Pclass1"] = X_test["Pclass"].apply(apply_Pclass_int)
X_test.info()
X_test.head()

<class 'pandas.core.frame.DataFrame'>
Index: 295 entries, 709 to 173
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  295 non-null    int64
 1   Pclass       295 non-null    int64
 2   Name         295 non-null    object
 3   Sex          295 non-null    object
 4   Age          236 non-null    float64
 5   SibSp        295 non-null    int64
 6   Parch        295 non-null    int64
 7   Ticket       295 non-null    object
 8   Fare         295 non-null    float64
 9   Cabin        70 non-null     object
 10  Embarked     294 non-null    object
 11  male         295 non-null    int64
 12  Pclass1      295 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 32.3+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1
709,710,3,"Moubarek, Master. Halim Gonios (""William George"")",male,NaN,1,1,2661,15.2458,NaN,C,1,0
439,440,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.0,0,0,C.A. 18723,10.5000,NaN,S,1,0
840,841,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S,1,0
720,721,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.0,0,1,248727,33.0000,NaN,S,0,0
39,40,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C,0,0

In [26]:
X_test["Pclass2"] = X_test["Pclass"].apply(apply_Pclass)
X_test.info()
X_test.head()

<class 'pandas.core.frame.DataFrame'>
Index: 295 entries, 709 to 173
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  295 non-null    int64
 1   Pclass       295 non-null    int64
 2   Name         295 non-null    object
 3   Sex          295 non-null    object
 4   Age          236 non-null    float64
 5   SibSp        295 non-null    int64
 6   Parch        295 non-null    int64
 7   Ticket       295 non-null    object
 8   Fare         295 non-null    float64
 9   Cabin        70 non-null     object
 10  Embarked     294 non-null    object
 11  male         295 non-null    int64
 12  Pclass1      295 non-null    int64
 13  Pclass2      295 non-null    int64
dtypes: float64(2), int64(7), object(5)
memory usage: 34.6+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2
709,710,3,"Moubarek, Master. Halim Gonios (""William George"")",male,NaN,1,1,2661,15.2458,NaN,C,1,0,0
439,440,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.0,0,0,C.A. 18723,10.5000,NaN,S,1,0,1
840,841,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S,1,0,0
720,721,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.0,0,1,248727,33.0000,NaN,S,0,0,1
39,40,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C,0,0,0

In [27]:
X_test["Pclass3"] = X_test["Pclass"].apply(apply_Pclass_last)
X_test.info()
X_test.head()

<class 'pandas.core.frame.DataFrame'>
Index: 295 entries, 709 to 173
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  295 non-null    int64
 1   Pclass       295 non-null    int64
 2   Name         295 non-null    object
 3   Sex          295 non-null    object
 4   Age          236 non-null    float64
 5   SibSp        295 non-null    int64
 6   Parch        295 non-null    int64
 7   Ticket       295 non-null    object
 8   Fare         295 non-null    float64
 9   Cabin        70 non-null     object
 10  Embarked     294 non-null    object
 11  male         295 non-null    int64
 12  Pclass1      295 non-null    int64
 13  Pclass2      295 non-null    int64
 14  Pclass3      295 non-null    int64
dtypes: float64(2), int64(8), object(5)
memory usage: 36.9+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2,Pclass3
709,710,3,"Moubarek, Master. Halim Gonios (""William George"")",male,NaN,1,1,2661,15.2458,NaN,C,1,0,0,1
439,440,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.0,0,0,C.A. 18723,10.5000,NaN,S,1,0,1,0
840,841,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S,1,0,0,1
720,721,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.0,0,1,248727,33.0000,NaN,S,0,0,1,0
39,40,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C,0,0,0,1

In [28]:
X_test["Age"].fillna(mean_age, inplace = True)
X_test.info()
X_test.head()

<class 'pandas.core.frame.DataFrame'>
Index: 295 entries, 709 to 173
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  295 non-null    int64
 1   Pclass       295 non-null    int64
 2   Name         295 non-null    object
 3   Sex          295 non-null    object
 4   Age          295 non-null    float64
 5   SibSp        295 non-null    int64
 6   Parch        295 non-null    int64
 7   Ticket       295 non-null    object
 8   Fare         295 non-null    float64
 9   Cabin        70 non-null     object
 10  Embarked     294 non-null    object
 11  male         295 non-null    int64
 12  Pclass1      295 non-null    int64
 13  Pclass2      295 non-null    int64
 14  Pclass3      295 non-null    int64
dtypes: float64(2), int64(8), object(5)
memory usage: 36.9+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2,Pclass3
709,710,3,"Moubarek, Master. Halim Gonios (""William George"")",male,29.525983,1,1,2661,15.2458,NaN,C,1,0,0,1
439,440,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.000000,0,0,C.A. 18723,10.5000,NaN,S,1,0,1,0
840,841,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.000000,0,0,SOTON/O2 3101287,7.9250,NaN,S,1,0,0,1
720,721,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.000000,0,1,248727,33.0000,NaN,S,0,0,1,0
39,40,3,"Nicola-Yarred, Miss. Jamila",female,14.000000,1,0,2651,11.2417,NaN,C,0,0,0,1

In [29]:
X_test["Embarked_S"] = X_test["Embarked"].apply(apply_embarked_S)
X_test.info()
X_test.head()

<class 'pandas.core.frame.DataFrame'>
Index: 295 entries, 709 to 173
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  295 non-null    int64
 1   Pclass       295 non-null    int64
 2   Name         295 non-null    object
 3   Sex          295 non-null    object
 4   Age          295 non-null    float64
 5   SibSp        295 non-null    int64
 6   Parch        295 non-null    int64
 7   Ticket       295 non-null    object
 8   Fare         295 non-null    float64
 9   Cabin        70 non-null     object
 10  Embarked     294 non-null    object
 11  male         295 non-null    int64
 12  Pclass1      295 non-null    int64
 13  Pclass2      295 non-null    int64
 14  Pclass3      295 non-null    int64
 15  Embarked_S   295 non-null    int64
dtypes: float64(2), int64(9), object(5)
memory usage: 39.2+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2,Pclass3,Embarked_S
709,710,3,"Moubarek, Master. Halim Gonios (""William George"")",male,29.525983,1,1,2661,15.2458,NaN,C,1,0,0,1,0
439,440,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.000000,0,0,C.A. 18723,10.5000,NaN,S,1,0,1,0,1
840,841,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.000000,0,0,SOTON/O2 3101287,7.9250,NaN,S,1,0,0,1,1
720,721,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.000000,0,1,248727,33.0000,NaN,S,0,0,1,0,1
39,40,3,"Nicola-Yarred, Miss. Jamila",female,14.000000,1,0,2651,11.2417,NaN,C,0,0,0,1,0

In [30]:
X_test["Embarked_Q"] = X_test["Embarked"].apply(apply_embarked_Q)
X_test.info()
X_test.head()

<class 'pandas.core.frame.DataFrame'>
Index: 295 entries, 709 to 173
Data columns (total 17 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  295 non-null    int64
 1   Pclass       295 non-null    int64
 2   Name         295 non-null    object
 3   Sex          295 non-null    object
 4   Age          295 non-null    float64
 5   SibSp        295 non-null    int64
 6   Parch        295 non-null    int64
 7   Ticket       295 non-null    object
 8   Fare         295 non-null    float64
 9   Cabin        70 non-null     object
 10  Embarked     294 non-null    object
 11  male         295 non-null    int64
 12  Pclass1      295 non-null    int64
 13  Pclass2      295 non-null    int64
 14  Pclass3      295 non-null    int64
 15  Embarked_S   295 non-null    int64
 16  Embarked_Q   295 non-null    int64
dtypes: float64(2), int64(10), object(5)
memory usage: 41.5+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2,Pclass3,Embarked_S,Embarked_Q
709,710,3,"Moubarek, Master. Halim Gonios (""William George"")",male,29.525983,1,1,2661,15.2458,NaN,C,1,0,0,1,0,0
439,440,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.000000,0,0,C.A. 18723,10.5000,NaN,S,1,0,1,0,1,0
840,841,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.000000,0,0,SOTON/O2 3101287,7.9250,NaN,S,1,0,0,1,1,0
720,721,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.000000,0,1,248727,33.0000,NaN,S,0,0,1,0,1,0
39,40,3,"Nicola-Yarred, Miss. Jamila",female,14.000000,1,0,2651,11.2417,NaN,C,0,0,0,1,0,0

In [31]:
X_test["Embarked_C"] = X_test["Embarked"].apply(apply_embarked_C)
X_test.info()
X_test.head()

<class 'pandas.core.frame.DataFrame'>
Index: 295 entries, 709 to 173
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  295 non-null    int64
 1   Pclass       295 non-null    int64
 2   Name         295 non-null    object
 3   Sex          295 non-null    object
 4   Age          295 non-null    float64
 5   SibSp        295 non-null    int64
 6   Parch        295 non-null    int64
 7   Ticket       295 non-null    object
 8   Fare         295 non-null    float64
 9   Cabin        70 non-null     object
 10  Embarked     294 non-null    object
 11  male         295 non-null    int64
 12  Pclass1      295 non-null    int64
 13  Pclass2      295 non-null    int64
 14  Pclass3      295 non-null    int64
 15  Embarked_S   295 non-null    int64
 16  Embarked_Q   295 non-null    int64
 17  Embarked_C   295 non-null    int64
dtypes: float64(2), int64(11), object(5)
memory usage: 43.8+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,male,Pclass1,Pclass2,Pclass3,Embarked_S,Embarked_Q,Embarked_C
709,710,3,"Moubarek, Master. Halim Gonios (""William George"")",male,29.525983,1,1,2661,15.2458,NaN,C,1,0,0,1,0,0,1
439,440,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.000000,0,0,C.A. 18723,10.5000,NaN,S,1,0,1,0,1,0,0
840,841,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.000000,0,0,SOTON/O2 3101287,7.9250,NaN,S,1,0,0,1,1,0,0
720,721,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.000000,0,1,248727,33.0000,NaN,S,0,0,1,0,1,0,0
39,40,3,"Nicola-Yarred, Miss. Jamila",female,14.000000,1,0,2651,11.2417,NaN,C,0,0,0,1,0,0,1

In [32]:
X_test = X_test.drop(columns = ["Name", "Sex", "Ticket", "Cabin", "Embarked"])
X_test.info()
X_test.head()

<class 'pandas.core.frame.DataFrame'>
Index: 295 entries, 709 to 173
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  295 non-null    int64
 1   Pclass       295 non-null    int64
 2   Age          295 non-null    float64
 3   SibSp        295 non-null    int64
 4   Parch        295 non-null    int64
 5   Fare         295 non-null    float64
 6   male         295 non-null    int64
 7   Pclass1      295 non-null    int64
 8   Pclass2      295 non-null    int64
 9   Pclass3      295 non-null    int64
 10  Embarked_S   295 non-null    int64
 11  Embarked_Q   295 non-null    int64
 12  Embarked_C   295 non-null    int64
dtypes: float64(2), int64(11)
memory usage: 32.3 KB

,PassengerId,Pclass,Age,SibSp,Parch,Fare,male,Pclass1,Pclass2,Pclass3,Embarked_S,Embarked_Q,Embarked_C
709,710,3,29.525983,1,1,15.2458,1,0,0,1,0,0,1
439,440,2,31.000000,0,0,10.5000,1,0,1,0,1,0,0
840,841,3,20.000000,0,0,7.9250,1,0,0,1,1,0,0
720,721,2,6.000000,0,1,33.0000,0,0,1,0,1,0,0
39,40,3,14.000000,1,0,11.2417,0,0,0,1,0,0,1

In [ ]:
# Classification pb:

# - logistic regression
# - decision tree
# - random forest
# - support vector machine
# - K Nearest Neighbour
# - Naive Bayes

# 1) Start by decision tree
clf = tree.DecisionTreeClassifier()
clf = clf.fit(X_train, y_train)

In [ ]:
# plotting the tree
tree.plot_tree(clf)

In [ ]:
# Predicting the results on the test dataset
y_pred = clf.predict(X_test)

In [ ]:
# Evaluating the model

## Model accuracy: how often is the classifier correct?
print("Accuracy:", metrics.accuracy_score(y_test, y_pred))

Interpretation model evaluation (decision tree):
- Default parameters: accuracy = 0.7593220338983051 (first run), 0.7661016949152543 (2nd run) => good accuracy

In [ ]:
# displaying the decision tree
dot_data = StringIO()
tree.export_graphviz(clf, out_file = dot_data,
                    filled = True, rounded = True,
                    special_characters = True)
graph = pydotplus.graph_from_dot_data(dot_data.getvalue())
graph.write_png('../reports/figures/titanic_decision_tree_colored.png')
Image(graph.create_png())

In [ ]:
# 2) Carry on with random forest

clf2 = RandomForestClassifier(max_depth = 2, random_state = 0)
clf2.fit(X_train, y_train)

In [ ]:
y_pred = clf2.predict(X_test)
y_pred
#print(clf2.predict(X_test))

In [ ]:
# Measuring the metrics for random forest classifier

### View accuracy score
accuracy_score(y_test, y_pred) # => 0.7728813559322034

In [ ]:
### Confusion matrix for test data and predictions
confusion_matrix(y_test, y_pred)

In [ ]:
#### Plotting the confusion matrix
#### Get and reshape confusion matrix data
matrix = confusion_matrix(y_test, y_pred)
matrix = matrix.astype('float') / matrix.sum(axis = 1)[:, np.newaxis]

#### Building the plot
plt.figure(figsize = (16,7))
sns.set(font_scale = 1.4)
sns.heatmap(matrix, annot = True, annot_kws = {'size':10},
           cmap = plt.cm.Greens, linewidths = 0.2)

#### Adding labels to the plot
class_names = np.array([0, 1])
tick_marks = np.arange(len(class_names)) + 0.5
tick_marks2 = tick_marks
plt.xticks(tick_marks, class_names, rotation = 0)
plt.yticks(tick_marks2, class_names, rotation = 0)
plt.xlabel('Predicted label')
plt.ylabel('True label')
plt.title('Confusion Matrix for Random Forest Model')
plt.savefig('../reports/figures/confusion_matrix_RFC.png')
#plt.show()

In [ ]:
### View the classification report for test data and predictions
print(classification_report(y_test, y_pred))

In [ ]:
# 3) kNN
neigh = KNeighborsClassifier(n_neighbors = 3)
neigh.fit(X_train, y_train)

In [ ]:
y_pred = neigh.predict(X_test)
y_pred

In [ ]:
print(neigh.predict_proba(X_test))

In [ ]:
neigh2 = NearestNeighbors(n_neighbors=1)
neigh2.fit(X_train, y_train)

In [ ]:
y_pred = neigh2.kneighbors(X_test)
y_pred

In [ ]:
neigh2.kneighbors(X_test, return_distance=False)

In [ ]:
A = neigh2.kneighbors_graph(X_test)
A.toarray()

In [ ]:
clf3 = Pipeline(steps = [("scaler", StandardScaler()), ("knn", KNeighborsClassifier(n_neighbors = 11))])

In [ ]:
# See how to proceed here

# _, axs = plt.subplots(ncols=2, figsize=(12, 5))

# for ax, weights in zip(axs, ("uniform", "distance")):
#     clf3.set_params(knn__weights=weights).fit(X_train, y_train)
#     disp = DecisionBoundaryDisplay.from_estimator(
#         clf3,
#         X_test,
#         response_method="predict",
#         plot_method="pcolormesh",
#         xlabel=X.feature_names[0],
#         ylabel=X.feature_names[1],
#         shading="auto",
#         alpha=0.5,
#         ax=ax,
#     )
#     scatter = disp.ax_.scatter(X_train, c=y, edgecolors="k")
#     disp.ax_.legend(
#         scatter.legend_elements()[0],
#         X_train.target_names,
#         loc="lower left",
#         title="Classes",
#     )
#     _ = disp.ax_.set_title(
#         f"3-Class classification\n(k={clf3[-1].n_neighbors}, weights={weights!r})"
#     )

# plt.show()

In [35]:
# 4) Logistic regression

clf4 = LogisticRegression().fit(X_train, y_train)
y_pred = clf4.predict(X_test)
y_pred

/home/caujoulat/miniforge3/envs/EnvML/lib/python3.12/site-packages/sklearn/linear_model/_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

array([0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1,
       0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1,
       0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0,
       0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0,
       1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 1, 0])

In [36]:
clf4.predict_proba(X_test)

array([[0.82973713, 0.17026287],
       [0.72432402, 0.27567598],
       [0.86594888, 0.13405112],
       [0.12048396, 0.87951604],
       [0.27362763, 0.72637237],
       [0.15837497, 0.84162503],
       [0.36043584, 0.63956416],
       [0.90276949, 0.09723051],
       [0.32237394, 0.67762606],
       [0.28179261, 0.71820739],
       [0.79593391, 0.20406609],
       [0.90892277, 0.09107723],
       [0.54568518, 0.45431482],
       [0.82211003, 0.17788997],
       [0.7439056 , 0.2560944 ],
       [0.17005938, 0.82994062],
       [0.77376439, 0.22623561],
       [0.32529667, 0.67470333],
       [0.66552055, 0.33447945],
       [0.80175812, 0.19824188],
       [0.8973722 , 0.1026278 ],
       [0.77580909, 0.22419091],
       [0.45455036, 0.54544964],
       [0.87272421, 0.12727579],
       [0.89053914, 0.10946086],
       [0.91366735, 0.08633265],
       [0.67946666, 0.32053334],
       [0.69928139, 0.30071861],
       [0.93080188, 0.06919812],
       [0.44395124, 0.55604876],
       [0.86223908, 0.13776092],
       [0.43739815, 0.56260185],
       [0.55725669, 0.44274331],
       [0.45641257, 0.54358743],
       [0.8922275 , 0.1077725 ],
       [0.80259966, 0.19740034],
       [0.78017662, 0.21982338],
       [0.37085441, 0.62914559],
       [0.09586386, 0.90413614],
       [0.88676879, 0.11323121],
       [0.67893688, 0.32106312],
       [0.90979236, 0.09020764],
       [0.88224017, 0.11775983],
       [0.84134609, 0.15865391],
       [0.35114701, 0.64885299],
       [0.93304628, 0.06695372],
       [0.8992325 , 0.1007675 ],
       [0.89264364, 0.10735636],
       [0.90130512, 0.09869488],
       [0.61656264, 0.38343736],
       [0.26291556, 0.73708444],
       [0.2165888 , 0.7834112 ],
       [0.95782644, 0.04217356],
       [0.62910528, 0.37089472],
       [0.92008057, 0.07991943],
       [0.17419263, 0.82580737],
       [0.75842008, 0.24157992],
       [0.04069604, 0.95930396],
       [0.19636216, 0.80363784],
       [0.34862587, 0.65137413],
       [0.88820331, 0.11179669],
       [0.16036717, 0.83963283],
       [0.18072593, 0.81927407],
       [0.78576942, 0.21423058],
       [0.87323504, 0.12676496],
       [0.22536793, 0.77463207],
       [0.62047012, 0.37952988],
       [0.89932543, 0.10067457],
       [0.8217868 , 0.1782132 ],
       [0.11778032, 0.88221968],
       [0.21330856, 0.78669144],
       [0.03523881, 0.96476119],
       [0.53453128, 0.46546872],
       [0.10220142, 0.89779858],
       [0.87166806, 0.12833194],
       [0.9087494 , 0.0912506 ],
       [0.31777443, 0.68222557],
       [0.11903137, 0.88096863],
       [0.20328971, 0.79671029],
       [0.56773518, 0.43226482],
       [0.92810954, 0.07189046],
       [0.20451601, 0.79548399],
       [0.08930602, 0.91069398],
       [0.84206292, 0.15793708],
       [0.71372005, 0.28627995],
       [0.70313507, 0.29686493],
       [0.08008578, 0.91991422],
       [0.09910181, 0.90089819],
       [0.79265492, 0.20734508],
       [0.90707506, 0.09292494],
       [0.90638903, 0.09361097],
       [0.53048844, 0.46951156],
       [0.82317608, 0.17682392],
       [0.8635948 , 0.1364052 ],
       [0.91294469, 0.08705531],
       [0.9034784 , 0.0965216 ],
       [0.78363331, 0.21636669],
       [0.92227973, 0.07772027],
       [0.20041738, 0.79958262],
       [0.90052145, 0.09947855],
       [0.84131638, 0.15868362],
       [0.90155405, 0.09844595],
       [0.07645831, 0.92354169],
       [0.91025843, 0.08974157],
       [0.88483783, 0.11516217],
       [0.9054128 , 0.0945872 ],
       [0.20673752, 0.79326248],
       [0.79336825, 0.20663175],
       [0.90488845, 0.09511155],
       [0.65643812, 0.34356188],
       [0.19179943, 0.80820057],
       [0.89552635, 0.10447365],
       [0.07183971, 0.92816029],
       [0.7765767 , 0.2234233 ],
       [0.41253928, 0.58746072],
       [0.86236683, 0.13763317],
       [0.75959483, 0.24040517],
       [0.58232093, 0.41767907],
       [0.1986233 , 0.8013767 ],
       [0.59563358, 0.40436642],
       [0.77906811, 0.22093189],
       [0.092463  , 0.907537  ],
       [0.28020083, 0.71979917],
       [0.70886701, 0.29113299],
       [0.87788793, 0.12211207],
       [0.60584341, 0.39415659],
       [0.24373908, 0.75626092],
       [0.51550655, 0.48449345],
       [0.2694822 , 0.7305178 ],
       [0.88417207, 0.11582793],
       [0.35424252, 0.64575748],
       [0.86615449, 0.13384551],
       [0.7319988 , 0.2680012 ],
       [0.30327991, 0.69672009],
       [0.63569129, 0.36430871],
       [0.20855707, 0.79144293],
       [0.06753907, 0.93246093],
       [0.90675397, 0.09324603],
       [0.90093976, 0.09906024],
       [0.44750317, 0.55249683],
       [0.87653711, 0.12346289],
       [0.18975537, 0.81024463],
       [0.71972278, 0.28027722],
       [0.73337263, 0.26662737],
       [0.52215074, 0.47784926],
       [0.21817205, 0.78182795],
       [0.73709767, 0.26290233],
       [0.84396352, 0.15603648],
       [0.06680738, 0.93319262],
       [0.90865841, 0.09134159],
       [0.79612756, 0.20387244],
       [0.88840278, 0.11159722],
       [0.87017306, 0.12982694],
       [0.38336263, 0.61663737],
       [0.91281605, 0.08718395],
       [0.89292553, 0.10707447],
       [0.84934308, 0.15065692],
       [0.38278262, 0.61721738],
       [0.19344309, 0.80655691],
       [0.39531298, 0.60468702],
       [0.80327576, 0.19672424],
       [0.75869667, 0.24130333],
       [0.712711  , 0.287289  ],
       [0.09136358, 0.90863642],
       [0.88169479, 0.11830521],
       [0.74162557, 0.25837443],
       [0.70264118, 0.29735882],
       [0.20686162, 0.79313838],
       [0.88466342, 0.11533658],
       [0.9101243 , 0.0898757 ],
       [0.59221295, 0.40778705],
       [0.20943507, 0.79056493],
       [0.77182421, 0.22817579],
       [0.22178042, 0.77821958],
       [0.88125718, 0.11874282],
       [0.78421242, 0.21578758],
       [0.71957954, 0.28042046],
       [0.17472919, 0.82527081],
       [0.44638218, 0.55361782],
       [0.8109342 , 0.1890658 ],
       [0.66669906, 0.33330094],
       [0.904956  , 0.095044  ],
       [0.89645132, 0.10354868],
       [0.48894136, 0.51105864],
       [0.26379231, 0.73620769],
       [0.79785414, 0.20214586],
       [0.55458208, 0.44541792],
       [0.91457573, 0.08542427],
       [0.78181709, 0.21818291],
       [0.17836025, 0.82163975],
       [0.91866873, 0.08133127],
       [0.74489773, 0.25510227],
       [0.88260567, 0.11739433],
       [0.91113082, 0.08886918],
       [0.25951083, 0.74048917],
       [0.17323507, 0.82676493],
       [0.02753146, 0.97246854],
       [0.69730756, 0.30269244],
       [0.15183821, 0.84816179],
       [0.53810232, 0.46189768],
       [0.93941307, 0.06058693],
       [0.42369936, 0.57630064],
       [0.16081693, 0.83918307],
       [0.55476975, 0.44523025],
       [0.75902695, 0.24097305],
       [0.30946425, 0.69053575],
       [0.88587905, 0.11412095],
       [0.74985277, 0.25014723],
       [0.79536953, 0.20463047],
       [0.92329043, 0.07670957],
       [0.34712033, 0.65287967],
       [0.90336145, 0.09663855],
       [0.12676718, 0.87323282],
       [0.85939506, 0.14060494],
       [0.55396931, 0.44603069],
       [0.92111647, 0.07888353],
       [0.18706819, 0.81293181],
       [0.68938632, 0.31061368],
       [0.15316357, 0.84683643],
       [0.90037199, 0.09962801],
       [0.91206568, 0.08793432],
       [0.18041172, 0.81958828],
       [0.90468445, 0.09531555],
       [0.76984531, 0.23015469],
       [0.8733056 , 0.1266944 ],
       [0.23653051, 0.76346949],
       [0.88686911, 0.11313089],
       [0.58661375, 0.41338625],
       [0.17871543, 0.82128457],
       [0.46760324, 0.53239676],
       [0.74774865, 0.25225135],
       [0.03068011, 0.96931989],
       [0.87008212, 0.12991788],
       [0.27123013, 0.72876987],
       [0.90955119, 0.09044881],
       [0.39321916, 0.60678084],
       [0.18116405, 0.81883595],
       [0.36220074, 0.63779926],
       [0.03374955, 0.96625045],
       [0.7118809 , 0.2881191 ],
       [0.89543564, 0.10456436],
       [0.21470473, 0.78529527],
       [0.80233039, 0.19766961],
       [0.39997799, 0.60002201],
       [0.79294462, 0.20705538],
       [0.89946858, 0.10053142],
       [0.89826401, 0.10173599],
       [0.87552319, 0.12447681],
       [0.8982896 , 0.1017104 ],
       [0.81603938, 0.18396062],
       [0.46597045, 0.53402955],
       [0.80776717, 0.19223283],
       [0.86148743, 0.13851257],
       [0.81570981, 0.18429019],
       [0.70201292, 0.29798708],
       [0.88051876, 0.11948124],
       [0.88149555, 0.11850445],
       [0.20660705, 0.79339295],
       [0.75403356, 0.24596644],
       [0.20312404, 0.79687596],
       [0.07788297, 0.92211703],
       [0.55444413, 0.44555587],
       [0.20916362, 0.79083638],
       [0.87835931, 0.12164069],
       [0.78460699, 0.21539301],
       [0.84794483, 0.15205517],
       [0.87687317, 0.12312683],
       [0.76056393, 0.23943607],
       [0.67455457, 0.32544543],
       [0.89064508, 0.10935492],
       [0.42782968, 0.57217032],
       [0.80544702, 0.19455298],
       [0.80431755, 0.19568245],
       [0.63935514, 0.36064486],
       [0.19081015, 0.80918985],
       [0.91170441, 0.08829559],
       [0.86227842, 0.13772158],
       [0.56564669, 0.43435331],
       [0.09340335, 0.90659665],
       [0.71388181, 0.28611819],
       [0.92897982, 0.07102018],
       [0.89885083, 0.10114917],
       [0.12852347, 0.87147653],
       [0.9229556 , 0.0770444 ],
       [0.54565166, 0.45434834],
       [0.91452044, 0.08547956],
       [0.38825032, 0.61174968],
       [0.91935704, 0.08064296],
       [0.70012375, 0.29987625],
       [0.87061858, 0.12938142],
       [0.8707079 , 0.1292921 ],
       [0.87602349, 0.12397651],
       [0.24454701, 0.75545299],
       [0.36002385, 0.63997615],
       [0.89796961, 0.10203039]])

In [39]:
clf4.score(X_test, y_test)

0.8033898305084746

In [41]:
# 5) SVM classification
clf5 = svm.SVC()
clf5.fit(X_train, y_train)

SVC()

In [42]:
clf5.predict(X_test)

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0])

In [43]:
clf5.support_vectors_

array([[  7.        ,   1.        ,  54.        , ...,   1.        ,
          0.        ,   0.        ],
       [719.        ,   3.        ,  29.52598326, ...,   0.        ,
          1.        ,   0.        ],
       [686.        ,   2.        ,  25.        , ...,   0.        ,
          0.        ,   1.        ],
       ...,
       [331.        ,   3.        ,  29.52598326, ...,   0.        ,
          1.        ,   0.        ],
       [107.        ,   3.        ,  21.        , ...,   1.        ,
          0.        ,   0.        ],
       [436.        ,   1.        ,  14.        , ...,   1.        ,
          0.        ,   0.        ]])